{
  "navigation": {
    "home": "Inicio",
    "experiences": "Experiencia",
    "about": "Sobre mí",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "home": {
    "subheading": {
      "1": "Soy desarrollador web"
    },
    "text": "Desarrollador web Fullstack apasionado por la programación, con alto nivel de compromiso y orientación al resultado. Mi experiencia profesional se ha desarrollado paralelamente a mis estudios y trabajo con el desarrollo de aplicaciones de software durante los últimos meses, adquiriendo así las aptitudes necesarias para resolver gran variedad de problemas ágil y eficientemente.",
    "download": "Descargar CV",
    "contact": "Contáctame"
  },
  "experiences": {
    "text": "Experiencia laboral que he ido adquiriendo en el ejercicio de cada uno de mis empleos. Siempre me aseguro de dar lo mejor de mí en cada rol, de forma tal que logre alcanzar los objetivos propuestos eficientemente.",
    "1": {
      "title": "Practicante analista de datos, automatizador de procesos",
      "company": "Tigo Colombia",
      "duration": "oct. 2021 - actualidad",
      "text1": "Desarrollar y mantener automatizaciones de Python para tareas diarias disminuyendo tiempos de ejecución hasta un 95%.",
      "text2": "Elaborar consultas SQL en Oracle, BigQuery y Amazon Athena para la extracción de datos específicos.",
      "text3": "Diseñar tableros automatizados en Tableau y Mixpanel facilitando el análisis de datos.",
      "text4": "Analizar sets de bases de datos disponiéndolos en la toma de decisiones de la compañía."
    }
  },
  "about": {
    "text-1": "Mi nombre es Juan Pablo Machado, soy estudiante tecnológico en análisis y desarrollo de sistemas de información en el SENA, Colombia, y ¡me apasiona bastante la programación!",
    "text-2": "Durante los últimos 2 años me he desempeñado en el desarrollo de proyectos y diferentes aplicaciones de software con el fin de poner en práctica las habilidades y conocimientos que voy adquiriendo en el paso del tiempo. ",
    "text-3": "Soy una persona proactiva, en continuo estudio, abierto a la adopción de nuevas tecnologías, con capacidad de trabajo en equipo y aprendizaje rápido de manera autodidacta, cualidades que me permiten afrontar cualquier reto y desenvolverme competentemente en el ámbito profesional."
  },
  "projects": {
    "text": "Proyectos en los que he trabajado con dedicación. Desde desarrollo de videojuegos, hasta desarrollo web, todos los proyectos en los que participo lo hago teniendo en mente mi objetivo: cada uno debe ser mejor que el anterior.",
    "view-more": "Ver más",
    "information": "Información",
    "technologies": "Tecnologías usadas",
    "view-project": "Ver proyecto",
    "view-repository": "Ver repositorio",
    "view-images": "Ver imágenes"
  },
  "contact": {
    "text": "¿Tienes preguntas, o quieres que trabajemos juntos?",
    "information": {
      "title": "¡Gracias por contactar!",
      "text": "Tendrás una respuesta lo más pronto posible."
    },
    "required": "El campo es requerido.",
    "send": "Enviar"
  },
  "footer": {
    "copyright": "Todos los derechos reservados",
    "made-by": "Portafolio hecho por"
  },
  "page-404": {
    "not-found": "¡Lo sentimos! La dirección a la que intentabas acceder no fué encontrada.",
    "please-home": "Por favor, regresa a la página principal.",
    "home-page": "Página principal"
  },
  "fields": {
    "name": "Nombre",
    "email": "Correo electrónico",
    "subject": "Asunto",
    "message": "Mensaje"
  },
  "validations": {
    "sending": "Enviando correo",
    "please-wait": "Por favor, espera...",
    "error": "Ha ocurrido un error.",
    "please-validate": "Por favor, valida todos los campos.",
    "email-send": "Mensaje envíado correctamente",
    "email-not-send": "El mensaje no se ha podido enviar. Por favor, intenta nuevamente.",
    "required": "El campo \"{field}\" es requerido.",
    "email": "El campo \"{field}\" debe tener una dirección de correo válida.",
    "min-length": "El campo \"{field}\" debe contener más de {n} caracteres.",
    "max-length": "El campo \"{field}\" debe contener menos de {n} caracteres."
  }
}