[
    {
        "company": "Perspektiva 360",
        "logo": "/assets/logos/perspektiva360.ico",
        "website": "https://perspektiva360.com",
        "role": "Desarrollador Full Stack",
        "date": "Jun. 2022 - Actualmente",
        "tasks": [
            "Desarrollar API y panel de administración de una App AR, permitiendo agregar marcadores y <b>ubicaciones geo-localizadas</b> con medios en AWS para una <b>ONG</b> de las <b>Naciones Unidas</b>.",
            "Desarrollar sistema de <b>gestión de gastos SaaS</b> para empresas y empleados, facilitando el control de gastos y la <b>visualización de gráficos</b> con estadísticas generales.",
            "Desarrollar una app web para un servicio de producción audiovisual, permitiendo a los usuarios <b>solicitar videos personalizados</b> y gestionarlos mediante herramientas para <b>añadir comentarios</b> en puntos específicos de sus videos y guiones PDF.",
            "Desarrollar herramientas web para optimizar procesos internos, incluyendo una <b>app de networking</b> impulsada con <b>IA</b>, un <b>generador de cotizaciones</b> y un <b>editor de landing pages</b>.",
            "Implementar funcionalidades personalizadas en <b>recorridos virtuales 360°</b> de <b>Pano2VR</b>, integrando servicios externos con su API."
        ]
    },
    {
        "company": "Tigo Colombia Movil",
        "logo": "/assets/logos/tigo.ico",
        "website": "https://www.tigo.com.co",
        "role": "Analista de datos",
        "date": "Prácticas: Oct. 2021 - Abr. 2022",
        "tasks": [
            "Desarrollar y mantener <b>web scrapper</b> para la extracción e interpretación de datos desde Mixpanel hacia Tableau a través de su API.",
            "Desarrollar y mantener <b>automatizaciones de Python</b> para tareas diarias disminuyendo tiempos de ejecución hasta un <b>95%</b>.",
            "Elaborar <b>consultas SQL personalizadas</b> en Oracle DB, BigQuery y Amazon Athena para la extracción de datos específicos.",
            "Diseñar dashboards con <b>gráficos automatizados</b> en Tableau y Mixpanel facilitando el análisis de datos."
        ]
    }
]